---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.StirrupTieAttachmentType.InteriorFace
enum: Autodesk.Revit.DB.Structure.StirrupTieAttachmentType
source: html/01887c64-36b1-1f7f-5ff9-1fb3ba4f3023.htm
---
# Autodesk.Revit.DB.Structure.StirrupTieAttachmentType.InteriorFace

Designate Stirrup/Tie rebar to attach to interior face of cover reference.